808017/ATmega4809-CNANO-Code-Examples/OLED_Test_2/oled.c
#include <xc.h>
#include <stdint.h>

#include "i2c.h"
#include "oled.h"

#define OLED_ADDR       0x3D

#define OLED_WIDTH      128
#define OLED_PAGES      8

#define OLED_COMMAND    0x00
#define OLED_DATA       0x40


/* ----------------------------------------------------
   5x7 ASCII FONT
   Keep your existing font5x7 array here
   from your previous working oled.c file.
   ---------------------------------------------------- */

static const uint8_t font5x7[128][5] =
{
    ['0'] = {0x3E,0x51,0x49,0x45,0x3E},
    ['1'] = {0x00,0x42,0x7F,0x40,0x00},
    ['2'] = {0x42,0x61,0x51,0x49,0x46},
    ['3'] = {0x21,0x41,0x45,0x4B,0x31},
    ['4'] = {0x18,0x14,0x12,0x7F,0x10},
    ['5'] = {0x27,0x45,0x45,0x45,0x39},
    ['6'] = {0x3C,0x4A,0x49,0x49,0x30},
    ['7'] = {0x01,0x71,0x09,0x05,0x03},
    ['8'] = {0x36,0x49,0x49,0x49,0x36},
    ['9'] = {0x06,0x49,0x49,0x29,0x1E},

    ['A'] = {0x7E,0x11,0x11,0x11,0x7E},
    ['B'] = {0x7F,0x49,0x49,0x49,0x36},
    ['C'] = {0x3E,0x41,0x41,0x41,0x22},
    ['D'] = {0x7F,0x41,0x41,0x22,0x1C},
    ['E'] = {0x7F,0x49,0x49,0x49,0x41},
    ['F'] = {0x7F,0x09,0x09,0x09,0x01},
    ['G'] = {0x3E,0x41,0x49,0x49,0x7A},
    ['H'] = {0x7F,0x08,0x08,0x08,0x7F},
    ['I'] = {0x00,0x41,0x7F,0x41,0x00},
    ['J'] = {0x20,0x40,0x41,0x3F,0x01},
    ['K'] = {0x7F,0x08,0x14,0x22,0x41},
    ['L'] = {0x7F,0x40,0x40,0x40,0x40},
    ['M'] = {0x7F,0x02,0x0C,0x02,0x7F},
    ['N'] = {0x7F,0x04,0x08,0x10,0x7F},
    ['O'] = {0x3E,0x41,0x41,0x41,0x3E},
    ['P'] = {0x7F,0x09,0x09,0x09,0x06},
    ['Q'] = {0x3E,0x41,0x51,0x21,0x5E},
    ['R'] = {0x7F,0x09,0x19,0x29,0x46},
    ['S'] = {0x46,0x49,0x49,0x49,0x31},
    ['T'] = {0x01,0x01,0x7F,0x01,0x01},
    ['U'] = {0x3F,0x40,0x40,0x40,0x3F},
    ['V'] = {0x1F,0x20,0x40,0x20,0x1F},
    ['W'] = {0x3F,0x40,0x38,0x40,0x3F},
    ['X'] = {0x63,0x14,0x08,0x14,0x63},
    ['Y'] = {0x07,0x08,0x70,0x08,0x07},
    ['Z'] = {0x61,0x51,0x49,0x45,0x43},

    ['a'] = {0x20,0x54,0x54,0x54,0x78},
    ['b'] = {0x7F,0x48,0x44,0x44,0x38},
    ['c'] = {0x38,0x44,0x44,0x44,0x20},
    ['d'] = {0x38,0x44,0x44,0x48,0x7F},
    ['e'] = {0x38,0x54,0x54,0x54,0x18},
    ['f'] = {0x08,0x7E,0x09,0x01,0x02},
    ['g'] = {0x0C,0x52,0x52,0x52,0x3E},
    ['h'] = {0x7F,0x08,0x04,0x04,0x78},
    ['i'] = {0x00,0x44,0x7D,0x40,0x00},
    ['j'] = {0x20,0x40,0x44,0x3D,0x00},
    ['k'] = {0x7F,0x10,0x28,0x44,0x00},
    ['l'] = {0x00,0x41,0x7F,0x40,0x00},
    ['m'] = {0x7C,0x04,0x18,0x04,0x78},
    ['n'] = {0x7C,0x08,0x04,0x04,0x78},
    ['o'] = {0x38,0x44,0x44,0x44,0x38},
    ['p'] = {0x7C,0x14,0x14,0x14,0x08},
    ['q'] = {0x08,0x14,0x14,0x18,0x7C},
    ['r'] = {0x7C,0x08,0x04,0x04,0x08},
    ['s'] = {0x48,0x54,0x54,0x54,0x20},
    ['t'] = {0x04,0x3F,0x44,0x40,0x20},
    ['u'] = {0x3C,0x40,0x40,0x20,0x7C},
    ['v'] = {0x1C,0x20,0x40,0x20,0x1C},
    ['w'] = {0x3C,0x40,0x30,0x40,0x3C},
    ['x'] = {0x44,0x28,0x10,0x28,0x44},
    ['y'] = {0x0C,0x50,0x50,0x50,0x3C},
    ['z'] = {0x44,0x64,0x54,0x4C,0x44},

    [' '] = {0x00,0x00,0x00,0x00,0x00},
    ['.'] = {0x00,0x60,0x60,0x00,0x00},
    [':'] = {0x00,0x36,0x36,0x00,0x00},
    ['-'] = {0x08,0x08,0x08,0x08,0x08},
    ['+'] = {0x08,0x08,0x3E,0x08,0x08}
};


/* ----------------------------------------------------
   Send one command
   ---------------------------------------------------- */
static void OLED_WriteCommand(uint8_t command)
{
    if (!I2C_StartWrite(OLED_ADDR))
    {
        I2C_Stop();
        return;
    }

    I2C_WriteByte(OLED_COMMAND);
    I2C_WriteByte(command);

    I2C_Stop();
}


/* ----------------------------------------------------
   Send one data byte
   ---------------------------------------------------- */
static void OLED_WriteData(uint8_t data)
{
    if (!I2C_StartWrite(OLED_ADDR))
    {
        I2C_Stop();
        return;
    }

    I2C_WriteByte(OLED_DATA);
    I2C_WriteByte(data);

    I2C_Stop();
}


/* ----------------------------------------------------
   Set page and column
   ---------------------------------------------------- */
void OLED_SetCursor(uint8_t page, uint8_t column)
{
    if (page >= 8)
        page = 0;

    if (column >= 128)
        column = 0;

    OLED_WriteCommand(0xB0 | page);
    OLED_WriteCommand(0x00 | (column & 0x0F));
    OLED_WriteCommand(0x10 | ((column >> 4) & 0x0F));
}


/* ----------------------------------------------------
   Clear display
   ---------------------------------------------------- */
void OLED_Clear(void)
{
    uint8_t page;
    uint8_t column;

    for (page = 0; page < 8; page++)
    {
        OLED_SetCursor(page, 0);

        for (column = 0; column < 128; column++)
        {
            OLED_WriteData(0x00);
        }
    }
}


/* ----------------------------------------------------
   OLED initialization
   ---------------------------------------------------- */
void OLED_Init(void)
{
    OLED_WriteCommand(0xAE);       // Display OFF

    OLED_WriteCommand(0xD5);
    OLED_WriteCommand(0x80);

    OLED_WriteCommand(0xA8);
    OLED_WriteCommand(0x3F);

    OLED_WriteCommand(0xD3);
    OLED_WriteCommand(0x00);

    OLED_WriteCommand(0x40);

    OLED_WriteCommand(0x8D);
    OLED_WriteCommand(0x14);

    OLED_WriteCommand(0x20);
    OLED_WriteCommand(0x02);       // Page addressing mode

    OLED_WriteCommand(0xA1);
    OLED_WriteCommand(0xC8);

    OLED_WriteCommand(0xDA);
    OLED_WriteCommand(0x12);

    OLED_WriteCommand(0x81);
    OLED_WriteCommand(0x7F);

    OLED_WriteCommand(0xD9);
    OLED_WriteCommand(0xF1);

    OLED_WriteCommand(0xDB);
    OLED_WriteCommand(0x40);

    OLED_WriteCommand(0xA4);
    OLED_WriteCommand(0xA6);

    OLED_Clear();

    OLED_WriteCommand(0xAF);       // Display ON
}


/* ----------------------------------------------------
   Write one character
   ---------------------------------------------------- */
void OLED_WriteChar(char c)
{
    uint8_t i;

    if (c < 0 || c > 127)
        c = ' ';

    for (i = 0; i < 5; i++)
    {
        OLED_WriteData(font5x7[(uint8_t)c][i]);
    }

    OLED_WriteData(0x00);
}


/* ----------------------------------------------------
   Write string
   ---------------------------------------------------- */
void OLED_WriteString(const char *text)
{
    if (text == 0)
        return;

    while (*text)
    {
        OLED_WriteChar(*text);
        text++;
    }
}


/* ----------------------------------------------------
   Write signed number
   ---------------------------------------------------- */
void OLED_WriteNumber(int16_t number)
{
    char buffer[8];
    uint8_t i = 0;
    uint8_t j;

    if (number == 0)
    {
        OLED_WriteChar('0');
        return;
    }

    if (number < 0)
    {
        OLED_WriteChar('-');
        number = -number;
    }

    while (number > 0)
    {
        buffer[i++] = (char)('0' + (number % 10));
        number = number / 10;
    }

    for (j = i; j > 0; j--)
    {
        OLED_WriteChar(buffer[j - 1]);
    }
}